## Staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                           |
|--------|----------------------------------------------------------|
| add    | `aws_cloudformation_stack.sms-usage-notifications`       |
|        | `aws_quicksight_refresh_schedule.smsusage-notifications` |
| update | `aws_quicksight_refresh_schedule.sms_usage`              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudformation_stack.sms-usage-notifications will be created
  + resource "aws_cloudformation_stack" "sms-usage-notifications" {
      + id                = (known after apply)
      + name              = "sms-usage-notifications"
      + notification_arns = [
          + "arn:aws:sns:ca-central-1:239043911459:aws-controltower-SecurityNotifications",
        ]
      + outputs           = (known after apply)
      + parameters        = (known after apply)
      + policy_body       = (known after apply)
      + tags_all          = (known after apply)
      + template_body     = jsonencode(
            {
              + Resources = {
                  + smsusageJoined = {
                      + Properties = {
                          + AwsAccountId              = "239043911459"
                          + DataSetId                 = "smsusage-notifications"
                          + DataSetUsageConfiguration = {
                              + DisableUseAsDirectQuerySource = false
                              + DisableUseAsImportedSource    = false
                            }
                          + ImportMode                = "SPICE"
                          + LogicalTableMap           = {
                              + nj-notifications          = {
                                  + Alias  = "nj-notifications"
                                  + Source = {
                                      + DataSetArn = "arn:aws:quicksight:ca-central-1:239043911459:dataset/notifications"
                                    }
                                }
                              + nj-notifications-smsusage = {
                                  + Alias          = "nj-notifications-sms-usage"
                                  + DataTransforms = [
                                      + {
                                          + ProjectOperation = {
                                              + ProjectedColumns = [
                                                  + "notification_id",
                                                  + "notification_created_at",
                                                  + "notification_sent_at",
                                                  + "notification_updated_at",
                                                  + "notification_type",
                                                  + "notification_status",
                                                  + "notification_queue_name",
                                                  + "notification_reference",
                                                  + "job_id",
                                                  + "api_key_id",
                                                  + "api_key_type",
                                                  + "service_id",
                                                  + "service_active",
                                                  + "service_count_as_live",
                                                  + "service_go_live_at",
                                                  + "service_name",
                                                  + "service_message_limit",
                                                  + "service_rate_limit",
                                                  + "service_sms_daily_limit",
                                                  + "template_id",
                                                  + "template_version",
                                                  + "template_name",
                                                  + "template_created_at",
                                                  + "template_updated_at",
                                                  + "organisation_name",
                                                  + "organisation_id",
                                                  + "PublishTimeUTC",
                                                  + "MessageId",
                                                  + "MessageType",
                                                  + "DeliveryStatus",
                                                  + "PriceInUSD",
                                                  + "PartNumber",
                                                  + "TotalParts",
                                                ]
                                            }
                                        },
                                    ]
                                  + Source         = {
                                      + JoinInstruction = {
                                          + LeftOperand  = "nj-sms-usage"
                                          + OnClause     = "{MessageId} = {notification_reference}"
                                          + RightOperand = "nj-notifications"
                                          + Type         = "LEFT"
                                        }
                                    }
                                }
                              + nj-sms-usage              = {
                                  + Alias  = "nj-sms-usage"
                                  + Source = {
                                      + DataSetArn = "arn:aws:quicksight:ca-central-1:239043911459:dataset/sms_usage"
                                    }
                                }
                            }
                          + Name                      = "Smsusage Notifications"
                          + Permissions               = [
                              + {
                                  + Actions   = [
                                      + "quicksight:DescribeDataSet",
                                      + "quicksight:DescribeDataSetPermissions",
                                      + "quicksight:DescribeIngestion",
                                      + "quicksight:ListIngestions",
                                      + "quicksight:PassDataSet",
                                    ]
                                  + Principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-viewers"
                                },
                              + {
                                  + Actions   = [
                                      + "quicksight:DescribeDataSet",
                                      + "quicksight:DescribeDataSetPermissions",
                                      + "quicksight:DescribeIngestion",
                                      + "quicksight:ListIngestions",
                                      + "quicksight:PassDataSet",
                                      + "quicksight:DeleteDataSet",
                                      + "quicksight:UpdateDataSet",
                                      + "quicksight:UpdateDataSetPermissions",
                                      + "quicksight:CreateIngestion",
                                      + "quicksight:CancelIngestion",
                                    ]
                                  + Principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-owners"
                                },
                            ]
                        }
                      + Type       = "AWS::QuickSight::DataSet"
                    }
                }
            }
        )
    }

  # aws_quicksight_refresh_schedule.sms_usage will be updated in-place
  ~ resource "aws_quicksight_refresh_schedule" "sms_usage" {
        id             = "239043911459,sms_usage,schedule-sms-usage"
        # (4 unchanged attributes hidden)

      ~ schedule {
          ~ start_after_date_time = "2024-03-19T06:22:12" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ schedule_frequency {
              ~ time_of_the_day = "02:30" -> "05:00"
              ~ timezone        = "UTC" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_quicksight_refresh_schedule.smsusage-notifications will be created
  + resource "aws_quicksight_refresh_schedule" "smsusage-notifications" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "sms-usage-notifications"
      + id             = (known after apply)
      + schedule_id    = "schedule-sms-usage-notifications"

      + schedule {
          + refresh_type          = "FULL_REFRESH"
          + start_after_date_time = (known after apply)

          + schedule_frequency {
              + interval        = "DAILY"
              + time_of_the_day = "07:45"
              + timezone        = (known after apply)
            }
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudformation_stack.sms-usage-notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-s3-usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.login_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.users"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.s3_sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.manifest_file"]

38 tests, 19 passed, 19 warnings, 0 failures, 0 exceptions

```

</details>
